<?php

$id_team = [
'1' => 'Авангард',
'2' => 'Автомобилист',
'3' => 'Адмирал',
'4' => 'Ак Барс',
'5' => 'Амур',
'6' => 'Барыс',
'7' => 'Витязь',
'8' => 'Динамо Мн',
'9' => 'Динамо Р',
'10' => 'Йокерит',
'11' => 'Куньлунь РС',
'12' => 'Лада',
'13' => 'Локомотив',
'14' => 'Металлург Мг',
'15' => 'Нефтехимик',
'16' => 'Салават Юлаев',
'17' => 'Северсталь',
'18' => 'Сибирь',
'19' => 'СКА',
'20' => 'Слован',
'21' => 'Спартак',
'22' => 'Торпедо',
'23' => 'Трактор',
'24' => 'ХК Динамо М',
'25' => 'ХК Сочи',
'26' => 'ЦСКА',
'27' => 'Югра'
]






?>